In [1]:
import pandas as pd
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score, precision_score, recall_score, f1_score, confusion_matrix, classification_report

In [2]:
df = pd.read_csv("online food.csv")
df = df.drop(columns=["Unnamed: 12"], axis = 1)

In [3]:
df.head()

,Age,Gender,Marital Status,Occupation,Monthly Income,Educational Qualifications,Family size,latitude,longitude,Pin code,Output,Feedback
0,20,Female,Single,Student,No Income,Post Graduate,4,12.9766,77.5993,560001,Yes,Positive
1,24,Female,Single,Student,Below Rs.10000,Graduate,3,12.9770,77.5773,560009,Yes,Positive
2,22,Male,Single,Student,Below Rs.10000,Post Graduate,3,12.9551,77.6593,560017,Yes,Negative
3,22,Female,Single,Student,No Income,Graduate,6,12.9473,77.5616,560019,Yes,Positive
4,22,Male,Single,Student,Below Rs.10000,Post Graduate,4,12.9850,77.5533,560010,Yes,Positive

In [4]:
df.drop(columns=["Pin code"])

,Age,Gender,Marital Status,Occupation,Monthly Income,Educational Qualifications,Family size,latitude,longitude,Output,Feedback
0,20,Female,Single,Student,No Income,Post Graduate,4,12.9766,77.5993,Yes,Positive
1,24,Female,Single,Student,Below Rs.10000,Graduate,3,12.9770,77.5773,Yes,Positive
2,22,Male,Single,Student,Below Rs.10000,Post Graduate,3,12.9551,77.6593,Yes,Negative
3,22,Female,Single,Student,No Income,Graduate,6,12.9473,77.5616,Yes,Positive
4,22,Male,Single,Student,Below Rs.10000,Post Graduate,4,12.9850,77.5533,Yes,Positive
...,...,...,...,...,...,...,...,...,...,...,...
383,23,Female,Single,Student,No Income,Post Graduate,2,12.9766,77.5993,Yes,Positive
384,23,Female,Single,Student,No Income,Post Graduate,4,12.9854,77.7081,Yes,Positive
385,22,Female,Single,Student,No Income,Post Graduate,5,12.9850,77.5533,Yes,Positive
386,23,Male,Single,Student,Below Rs.10000,Post Graduate,2,12.9770,77.5773,Yes,Positive
387,23,Male,Single,Student,No Income,Post Graduate,5,12.8988,77.5764,Yes,Positive

In [5]:
df["Gender"].replace({"Female": 0, "Male": 1, "Other": 2}, inplace=True)
df.head()

,Age,Gender,Marital Status,Occupation,Monthly Income,Educational Qualifications,Family size,latitude,longitude,Pin code,Output,Feedback
0,20,0,Single,Student,No Income,Post Graduate,4,12.9766,77.5993,560001,Yes,Positive
1,24,0,Single,Student,Below Rs.10000,Graduate,3,12.9770,77.5773,560009,Yes,Positive
2,22,1,Single,Student,Below Rs.10000,Post Graduate,3,12.9551,77.6593,560017,Yes,Negative
3,22,0,Single,Student,No Income,Graduate,6,12.9473,77.5616,560019,Yes,Positive
4,22,1,Single,Student,Below Rs.10000,Post Graduate,4,12.9850,77.5533,560010,Yes,Positive

In [6]:
df["Marital Status"].replace({"Single": 0, "Married": 1, "Prefer not to say": 2}, inplace=True)

In [7]:
df.head()

,Age,Gender,Marital Status,Occupation,Monthly Income,Educational Qualifications,Family size,latitude,longitude,Pin code,Output,Feedback
0,20,0,0,Student,No Income,Post Graduate,4,12.9766,77.5993,560001,Yes,Positive
1,24,0,0,Student,Below Rs.10000,Graduate,3,12.9770,77.5773,560009,Yes,Positive
2,22,1,0,Student,Below Rs.10000,Post Graduate,3,12.9551,77.6593,560017,Yes,Negative
3,22,0,0,Student,No Income,Graduate,6,12.9473,77.5616,560019,Yes,Positive
4,22,1,0,Student,Below Rs.10000,Post Graduate,4,12.9850,77.5533,560010,Yes,Positive

In [8]:
df["Occupation"].value_counts()

Occupation
Student           207
Employee          118
Self Employeed     54
House wife          9
Name: count, dtype: int64

In [9]:
df["Occupation"].replace({"Student": 0, "Employee": 1, "Self Employeed": 2, "House wife": 3}, inplace=True)

In [10]:
df["Monthly Income"].value_counts()

Monthly Income
No Income          187
25001 to 50000      69
More than 50000     62
10001 to 25000      45
Below Rs.10000      25
Name: count, dtype: int64

In [11]:
df["Monthly Income"].replace({"No Income": 0, "Below Rs.10000": 1, "10001 to 25000": 2, "25001 to 50000": 3, "More than 50000": 4}, inplace=True)

In [12]:
df.head()

,Age,Gender,Marital Status,Occupation,Monthly Income,Educational Qualifications,Family size,latitude,longitude,Pin code,Output,Feedback
0,20,0,0,0,0,Post Graduate,4,12.9766,77.5993,560001,Yes,Positive
1,24,0,0,0,1,Graduate,3,12.9770,77.5773,560009,Yes,Positive
2,22,1,0,0,1,Post Graduate,3,12.9551,77.6593,560017,Yes,Negative
3,22,0,0,0,0,Graduate,6,12.9473,77.5616,560019,Yes,Positive
4,22,1,0,0,1,Post Graduate,4,12.9850,77.5533,560010,Yes,Positive

In [13]:
df["Educational Qualifications"].value_counts()

Educational Qualifications
Graduate         177
Post Graduate    174
Ph.D              23
School            12
Uneducated         2
Name: count, dtype: int64

In [14]:
df["Educational Qualifications"].replace({"Uneducated": 0, "School": 1, "Graduate": 2, "Post Graduate": 3, "Ph.D": 4}, inplace=True)

In [15]:
df["Feedback"].value_counts()

Feedback
Positive    317
Negative     71
Name: count, dtype: int64

In [16]:
df["Feedback"].replace({"Positive": 1, "Negative": 0}, inplace=True)

In [17]:
df.head()

,Age,Gender,Marital Status,Occupation,Monthly Income,Educational Qualifications,Family size,latitude,longitude,Pin code,Output,Feedback
0,20,0,0,0,0,3,4,12.9766,77.5993,560001,Yes,1
1,24,0,0,0,1,2,3,12.9770,77.5773,560009,Yes,1
2,22,1,0,0,1,3,3,12.9551,77.6593,560017,Yes,0
3,22,0,0,0,0,2,6,12.9473,77.5616,560019,Yes,1
4,22,1,0,0,1,3,4,12.9850,77.5533,560010,Yes,1

In [18]:
df["Output"].replace({"Yes": 1, "No": 0}, inplace=True)

In [19]:
df.head()

,Age,Gender,Marital Status,Occupation,Monthly Income,Educational Qualifications,Family size,latitude,longitude,Pin code,Output,Feedback
0,20,0,0,0,0,3,4,12.9766,77.5993,560001,1,1
1,24,0,0,0,1,2,3,12.9770,77.5773,560009,1,1
2,22,1,0,0,1,3,3,12.9551,77.6593,560017,1,0
3,22,0,0,0,0,2,6,12.9473,77.5616,560019,1,1
4,22,1,0,0,1,3,4,12.9850,77.5533,560010,1,1

In [20]:
X = df.drop(columns=["Output"])
y = df["Output"]

In [21]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [22]:
model = LogisticRegression()
model.fit(X_train, y_train)

LogisticRegression()

In [23]:
y_pred = model.predict(X_test)

In [24]:
print("Accuracy:", accuracy_score(y_test, y_pred))
print("Precision:", precision_score(y_test, y_pred))
print("Recall:", recall_score(y_test, y_pred))
print("F1 Score:", f1_score(y_test, y_pred))
print("\nConfusion Matrix:\n", confusion_matrix(y_test, y_pred))
print("\nClassification Report:\n", classification_report(y_test, y_pred))

Accuracy: 0.8461538461538461
Precision: 0.8461538461538461
Recall: 1.0
F1 Score: 0.9166666666666666

Confusion Matrix:
 [[ 0 12]
 [ 0 66]]

Classification Report:
               precision    recall  f1-score   support

           0       0.00      0.00      0.00        12
           1       0.85      1.00      0.92        66

    accuracy                           0.85        78
   macro avg       0.42      0.50      0.46        78
weighted avg       0.72      0.85      0.78        78

/opt/conda/envs/anaconda-2024.02-py310/lib/python3.10/site-packages/sklearn/metrics/_classification.py:1469: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))
/opt/conda/envs/anaconda-2024.02-py310/lib/python3.10/site-packages/sklearn/metrics/_classification.py:1469: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))
/opt/conda/envs/anaconda-2024.02-py310/lib/python3.10/site-packages/sklearn/metrics/_classification.py:1469: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))